// трябва да напишем JS функция, която зарежда GitHub Repository асинхромно с AJAX заявка и ние трябва да ползваме Fetch API-то. Трябва да вземем данните използвайки GET request на подадения URL. 
// трябва да трансформираме боди-то към текст със res.text() (тоест тук не ни искат да връщаме JSON, а някакъв текст) и после да имаме втори then блок, в който реплейсваме текста в div-a с id"res" със ст-ста на този response.  

// то този начин става връзката между някакъв сървър и фронт-енд. Праща се Fetch заявка, тя връща промис

function loadRepos() {
   const BASE_URL = 'https://api.github.com/users/testnakov/repos';
   const resultContainer = document.getElementById('res'); 
   
   // в долния ред ползваме fetch API-то. Вътре подаваме базовия URL и като втори аргумент се подават самите хедъри, сиреч какъв да е HTTP метода, в нашия случай е GET (и по дефолт е така ппц). 
   fetch(BASE_URL, {method: 'GET'})
      .then((res) => res.text()) // тук вместо text можеше да сложим JSON, но задачата изисква text. Съответно text изисква втори промис, който трябва да е стринг
      .then((data) => {
         resultContainer.textContent = data; // правим така че текст контента на resultContainer да ни е данните които ще ни се върнат
      })
      .catch((err) => { // винаги като работим с промиси, трябва да имаме и един catch блок, да логваме грешката на конзолата, за да можем да се подсигурим, ако нещо горе фейлне
         console.error(err)
      })
   console.log("TODO...")
}